package com.dili.customer.enums;

import lombok.Getter;

/**
 * <B>名族数据枚举定义</B>
 * <B>Copyright:本软件源代码版权归农丰时代所有,未经许可不得任意复制与传播.</B>
 * <B>农丰时代科技有限公司</B>
 *
 * @author yuehongbo
 * @date 2020/2/28 14:14
 */
public enum NationalityEnum {

    汉族(1, "汉族"),
    蒙古族(2, "蒙古族"),
    回族(3, "回族"),
    藏族(4, "藏族"),
    维吾尔族(5, "维吾尔族"),
    苗族(6, "苗族"),
    彝族(7, "彝族"),
    壮族(8, "壮族"),
    布依族(9, "布依族"),
    朝鲜族(10, "朝鲜族"),
    满族(11, "满族"),
    侗族(12, "侗族"),
    瑶族(13, "瑶族"),
    白族(14, "白族"),
    土家族(15, "土家族"),
    哈尼族(16, "哈尼族"),
    哈萨克族(17, "哈萨克族"),
    傣族(18, "傣族"),
    黎族(19, "黎族"),
    傈僳族(20, "傈僳族"),
    佤族(21, "佤族"),
    畲族(22, "畲族"),
    高山族(23, "高山族"),
    拉祜族(24, "拉祜族"),
    水族(25, "水族"),
    东乡族(26, "东乡族"),
    纳西族(27, "纳西族"),
    景颇族(28, "景颇族"),
    柯尔克孜族(29, "柯尔克孜族"),
    土族(30, "土族"),
    达斡尔族(31, "达斡尔族"),
    仫佬族(32, "仫佬族"),
    羌族(33, "羌族"),
    布朗族(34, "布朗族"),
    撒拉族(35, "撒拉族"),
    毛难族(36, "毛难族"),
    仡佬族(37, "仡佬族"),
    锡伯族(38, "锡伯族"),
    阿昌族(39, "阿昌族"),
    普米族(40, "普米族"),
    塔吉克族(41, "塔吉克族"),
    怒族(42, "怒族"),
    乌孜别克族(43, "乌孜别克族"),
    俄罗斯族(44, "俄罗斯族"),
    鄂温克族(45, "鄂温克族"),
    崩龙族(46, "崩龙族"),
    保安族(47, "保安族"),
    裕固族(48, "裕固族"),
    京族(49, "京族"),
    塔塔尔族(50, "塔塔尔族"),
    独龙族(51, "独龙族"),
    鄂伦春族(52, "鄂伦春族"),
    赫哲族(53, "赫哲族"),
    门巴族(54, "门巴族"),
    珞巴族(55, "珞巴族"),
    基诺族(56, "基诺族"),
    其他(57, "其他"),
    ;
    @Getter
    private Integer code;
    @Getter
    private String value;

    NationalityEnum(Integer code, String value) {
        this.code = code;
        this.value = value;
    }

    /**
     * 获取某个枚举值实例信息
     *
     * @param code
     * @return
     */
    public static NationalityEnum getInstance(Integer code) {
        for (NationalityEnum nationality : NationalityEnum.values()) {
            if (nationality.getCode().equals(code)) {
                return nationality;
            }
        }
        return null;
    }
}
